package mock.day1023;

/**
 * @author Jiaqing Shen
 * @description
 * @date Created in 2021/10/23
 */
public class q6 {

    //[团建题目] 6. 给出一个不包含重复元素的数组nums。我们按照数值从小到大的顺序依次删除。打印每一个回合被删除的元素在此时数组里的index。
    //nums = [3, 5, 1, 4, 2]
    //        0  0  2  1  3
    //        2 3 0 1 0

    //   3 5 1 -- 4 2
    //   3 5 -- 1     4 -- 2
    //   1 3 5  ----  2 4
    //   2 0 0        1 0
    //   1 3 5 -- 2 4
    //   1 2 3 4 5
    //   2 3 0 1 0
    //[3, 5, 1, 4, 2] 删除1，位于 idx = 2
    //[3, 5, 4, 2] 删除2，位于 idx = 3
    //[3, 5, 4] 删除3，位于 idx = 0
    //[5, 4] 删除4，位于 idx = 1
    //[5] 删除5，位于 idx = 0
    //最终的答案是[2,3,0,1,0]

    // list[1,3]
    // stack[5,4,2]
    // res[] = [2,3,0,1,0]
}
